IDEA StatiCa Open Model
ConcreteCheckResults.CheckResults Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 All results
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ConcreteCheckResult> CheckResults { get; set; }
Public Property CheckResults As List(Of ConcreteCheckResult)
	Get
	Set
public:
property List<ConcreteCheckResult^>^ CheckResults {
	List<ConcreteCheckResult^>^ get ();
	void set (List<ConcreteCheckResult^>^ value);
}
Property Value
Type: List<ConcreteCheckResult>
See Also
Reference
ConcreteCheckResults Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace